{
  "Projects": [
    {
      "show": true,
      "title": "Automatic Notes maker",
      "desc": [
        "The Automatic Notes Maker Web Application is an innovative tool designed to streamline the process of generating structured and concise notes from text. Developed as a collaborative project, it utilizes the Transformer architecture introduced by Vaswani et al. (2017) to ensure accurate and context-aware summarization. Built using Python, TensorFlow, Flask, HTML, and CSS, the application combines cutting-edge natural language processing with a user-friendly web interface. Users can input raw text, and the system automatically produces well-organized notes tailored to their needs.", 
        "The website features a clean, modern design that appeals to a wide audience, making it intuitive and easy to use. Additionally, the project includes an IPYNB file for model training and fine-tuning, as well as the pre-trained model, providing flexibility for developers and researchers to customize the system further. This application is ideal for students, professionals, and anyone seeking an efficient way to transform textual information into actionable notes."
      ],
      "year": "2024",
      "preview": "https://automated-notes-maker.netlify.app/",
      "code": "https://github.com/",
      "thumbnail": "/image/projects/ai/javanese-translation/javanese-translation-thumbnail.jpg",
      "images": [
        "/image/projects/ai/javanese-translation/javanese-translation1.png",
        "/image/projects/ai/javanese-translation/javanese-translation2.png"
      ],
      "tech": [
        "Transformers",
        "Python",
        "Tensorflow",
        "Flask",
        "HTML",
        "CSS"
      ], 
      "slug": "javanese-translation",
      "category": 2
    },
    {
      "show": true,
      "title": "SIPETI: Heart Prediction Website",
      "desc": [
        "This is a Machine Learning based website that I created as a collage project. The website is built using Decision Tree algorithm and Flask. The website is a heart attack prediction website that can predict whether a person will get a heart attack or not based on their health condition.",
        "In this website user can predict, customize dataset, customize model, and see the model performance. The website also has a few features such as a dashboard for the user to see the model performance, and a few charts to visualize the decision tree model."
      ],
      "year": "2024",
      "preview": "",
      "code": "https://github.com/phanikiran1619",
      "thumbnail": "/image/projects/ai/heart-attack-prediction/heart-attack-prediction-thumbnail.jpg",
      "images": [
        "/image/projects/ai/heart-attack-prediction/heart-attack1.png",
        "/image/projects/ai/heart-attack-prediction/heart-attack2.png",
        "/image/projects/ai/heart-attack-prediction/heart-attack3.png",
        "/image/projects/ai/heart-attack-prediction/heart-attack4.png",
        "/image/projects/ai/heart-attack-prediction/heart-attack5.png"
      ],
      "tech": [
        "Decision Tree",
        "Python",
        "Sklearn",
        "Flask",
        "HTML",
        "CSS"
      ], 
      "slug": "heart-attack",
      "category": 2
    },
    {
      "show": true,
      "title": "Generative Trivia",
      "desc": [
        "A generative trivia website built with Next.js, Firebase, NextAuth, Google OAuth, and TypeScript. Users can generate trivia questions for predefined school subjects and answer them with a unique interactive input style. The application supports user authentication with Google and stores data in Firestore.",
        "The project is a culmination of my passion for web development and my desire to create a fun and interactive learning platform. The website is designed to be user-friendly and engaging, with a clean and modern interface that appeals to a wide audience. The trivia questions are generated using the Gemini API, which provides a diverse range of questions for users to answer."
      ],
      "year": "2024",
      "preview": "https://generativ-trivia.vercel.app/",
      "code": "https://github.com/phanikiran1619",
      "thumbnail": "/image/projects/web/trivia/trivia-thumbnail.png",
      "images": [
        "/image/projects/web/trivia/trivia1.png",
        "/image/projects/web/trivia/trivia2.png",
        "/image/projects/web/trivia/trivia3.png"
      ],
      "tech": [
        "NextJS",
        "Shadcn UI",
        "Tailwind CSS",
        "Firebase",
        "Gemini API"
      ], 
      "slug": "trivia",
      "category": 1
    },
    {
      "show": true,
      "title": "Saku Senyum",
      "desc": [
        "Saku Senyum is a website that I created as a Fullstack Developer in PT Hafdzahmedia based on client request. The website is a sales management for UMKM or small business. The website is built using Next.js, TypeScript, Tailwind CSS, ShadCN UI, Prisma, and MySQL.",
        "The website has a few features such as a dashboard for the user to manage their business sales, a statistic page, and a sales report page. User can see their sales performance in a fancy chart to make it easier to understand. The user also can export their sales report to a PDF file which can be printed or saved to their device."
      ],
      "year": "2024",
      "code": "https://github.com/phanikiran1619",
      "thumbnail": "/image/projects/web/saku-senyum/saku-senyum-thumbnail.png",
      "images": [
        "/image/projects/web/saku-senyum/saku-senyum1.png",
        "/image/projects/web/saku-senyum/saku-senyum2.png",
        "/image/projects/web/saku-senyum/saku-senyum3.png",
        "/image/projects/web/saku-senyum/saku-senyum4.png"
      ],
      "tech": [
        "NextJS",
        "Typescript",
        "Shadcn UI",
        "Tailwind CSS",
        "Prisma",
        "MySQL"
      ], 
      "slug": "saku-senyum",
      "category": 1
    },
    {
      "show": true,
      "title": "React Tools",
      "desc": [
        "React Tools is a groundbreaking and user-friendly project that brings together a comprehensive collection of tools and components crafted with cutting-edge technologies, including React, React Router, and TailwindCSS. What sets this project apart is that it's not just a suite of powerful features, but it's also a significant milestone as it marks my very first venture into the world of React development.",

        "Unlike traditional web applications, React Tools cleverly utilizes browser local storage, eliminating the need for external databases. This not only ensures seamless performance but also prioritizes user data privacy. ",

        "The Todo List keeps tasks in check with intuitive task management capabilities, ensuring you never miss a beat. The note-taking feature provides a hassle-free way to jot down ideas and crucial information, accessible whenever inspiration strikes. Additionally, our robust expense tracker simplifies financial management by recording and categorizing expenses, delivering insightful spending analysis."
      ],
      "year": "2023",
      "preview": "https://reac-tools-flax.vercel.app",
      "code": "https://github.com/phanikiran1619",
      "thumbnail": "/image/projects/web/tools/tools-thumbnail.png",
      "images": [
        "/image/projects/web/tools/tools.png",
        "/image/projects/web/tools/tools1.png",
        "/image/projects/web/tools/tools2.png",
        "/image/projects/web/tools/tools3.png"
      ],
      "tech": [
        "Javascript",
        "React",
        "React Router",
        "TailwindCSS"
      ],
      "slug": "react-tools",
      "category": 1
    }
  ]
}
